In [2]:
%load_ext lab_black
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

In [3]:
import io
import pandas as pd

In [4]:
emp = pd.read_csv(
    io.StringIO(
        """
        EMPNO ENAME  JOB        MGR HIREDATE     SAL COMM  DEPTNO
        ----- ------ --------- ---- ----------- ---- ---- -------
         7369 SMITH  CLERK     7902 17-DEC-2005  800    -      20
         7499 ALLEN  SALESMAN  7698 20-FEB-2006 1600  300      30
         7521 WARD   SALESMAN  7698 22-FEB-2006 1250  500      30
         7566 JONES  MANAGER   7839 02-APR-2006 2975    -      20
         7654 MARTIN SALESMAN  7698 28-SEP-2006 1250 1400      30
         7698 BLAKE  MANAGER   7839 01-MAY-2006 2850    -      30
         7782 CLARK  MANAGER   7839 09-JUN-2006 2450    -      10
         7788 SCOTT  ANALYST   7566 09-DEC-2007 3000    -      20
         7839 KING   PRESIDENT    - 17-NOV-2006 5000    -      10
         7844 TURNER SALESMAN  7698 08-SEP-2006 1500    0      30
         7876 ADAMS  CLERK     7788 12-JAN-2008 1100    -      20
         7900 JAMES  CLERK     7698 03-DEC-2006  950    -      30
         7902 FORD   ANALYST   7566 03-DEC-2006 3000    -      20
         7934 MILLER CLERK     7782 23-JAN-2007 1300    -      10
        """
    ),
    engine="python",
    na_values="-",
    sep="\s+",
).drop(0)
emp.to_csv("data/emp.csv", index=0)
emp

   EMPNO   ENAME        JOB   MGR     HIREDATE   SAL  COMM DEPTNO
1   7369   SMITH      CLERK  7902  17-DEC-2005   800   NaN     20
2   7499   ALLEN   SALESMAN  7698  20-FEB-2006  1600   300     30
3   7521    WARD   SALESMAN  7698  22-FEB-2006  1250   500     30
4   7566   JONES    MANAGER  7839  02-APR-2006  2975   NaN     20
5   7654  MARTIN   SALESMAN  7698  28-SEP-2006  1250  1400     30
6   7698   BLAKE    MANAGER  7839  01-MAY-2006  2850   NaN     30
7   7782   CLARK    MANAGER  7839  09-JUN-2006  2450   NaN     10
8   7788   SCOTT    ANALYST  7566  09-DEC-2007  3000   NaN     20
9   7839    KING  PRESIDENT   NaN  17-NOV-2006  5000   NaN     10
10  7844  TURNER   SALESMAN  7698  08-SEP-2006  1500     0     30
11  7876   ADAMS      CLERK  7788  12-JAN-2008  1100   NaN     20
12  7900   JAMES      CLERK  7698  03-DEC-2006   950   NaN     30
13  7902    FORD    ANALYST  7566  03-DEC-2006  3000   NaN     20
14  7934  MILLER      CLERK  7782  23-JAN-2007  1300   NaN     10

In [5]:
%%sql
create table if not exists emp
(
    empno    int  not null,
    ename    text not null,
    job      text not null,
    mgr      int,
    hiredate date not null,
    sal      int  not null,
    comm     int,
    deptno   int  not null
);
copy emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) from '/tmp/data/emp.csv' delimiter ',' csv header;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
14 rows affected.

[]

In [6]:
dept = pd.read_csv(
    io.StringIO(
        """
        DEPTNO DNAME          LOC
        ------ -------------- ---------
            10 ACCOUNTING     NEW YORK
            20 RESEARCH       DALLAS
            30 SALES          CHICAGO
            40 OPERATIONS     BOSTON
        """
    ),
    engine="python",
    sep="\s+(?!YORK)",
).drop(0)
dept.to_csv("data/dept.csv", index=0)
dept

  DEPTNO       DNAME       LOC
1     10  ACCOUNTING  NEW YORK
2     20    RESEARCH    DALLAS
3     30       SALES   CHICAGO
4     40  OPERATIONS    BOSTON

In [7]:
%%sql
create table if not exists dept
(
    deptno int  not null,
    dname  text not null,
    loc    text not null
);
copy dept (deptno, dname, loc) from '/tmp/data/dept.csv' delimiter ',' csv header;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
4 rows affected.

[]

In [8]:
%%sql
create table if not exists t1
(
    id int not null
);
insert into t1 (id) (select i from generate_series(1, 1) as s(i));

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
1 rows affected.

[]

In [9]:
%%sql
create table if not exists t10
(
    id int not null
);
insert into t10 (id) (select i from generate_series(1, 10) as s(i));

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
10 rows affected.

[]

In [10]:
%%sql
create table if not exists t100
(
    id int not null
);
insert into t100 (id) (select i from generate_series(1, 100) as s(i));

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
100 rows affected.

[]

In [11]:
%%sql
create table if not exists t500
(
    id int not null
);
insert into t500 (id) (select i from generate_series(1, 500) as s(i));

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
500 rows affected.

[]